---
kind: type
id: T:Autodesk.Revit.DB.Visual.Concrete
source: html/a3b65010-dc9e-f2ee-46ed-97e453198a62.htm
---
# Autodesk.Revit.DB.Visual.Concrete

A static class that provides access to the property names that appear in the Concrete visual asset schema.

## Syntax (C#)
```csharp
public static class Concrete
```